deps_c.dot
digraph WeaverEngineC {
  node [shape=box, style=filled, fillcolor=lightblue];
  "state_globals.c";
  "ring_stream.c";
  "lifecycle.c";
  "thread_pool.c";
  "main_headless.c" -> "sys_sync.c";
  "thread_lifecycle.c";
  "lua_vm.c";
  "sys_sync.c";
  "mailbox.c";
  "main.c" -> "ssot_types.h";
  "main.c" -> "ssot_render.h";
  "main.c" -> "sys_sync.c";
  "main.c" -> "state_types.c";
  "main.c" -> "state_globals.c";
  "main.c" -> "thread_pool.c";
  "main.c" -> "mailbox.c";
  "main.c" -> "lifecycle.c";
  "main.c" -> "ring_stream.c";
  "main.c" -> "tenant_callbacks_state.c";
  "main.c" -> "tenant_callbacks_mouse.c";
  "main.c" -> "tenant_callbacks_key.c";
  "main.c" -> "tenant_input.c";
  "main.c" -> "tenant_sys.c";
  "main.c" -> "vk_debug.c";
  "main.c" -> "vk_tenant_alloc.c";
  "main.c" -> "vk_transfer_api.c";
  "main.c" -> "vk_transfer_loop.c";
  "main.c" -> "vk_draw.c";
  "main.c" -> "vk_record.c";
  "main.c" -> "vk_render_loop.c";
  "main.c" -> "thread_lifecycle.c";
  "main.c" -> "lua_vm.c";
  "main.c" -> "main_loop.c";
  "main_loop.c";
  "state_types.c";
  "shared_structs.h";
  "vx_net.c" -> "shared_structs.h";
  "vk_transfer_api.c";
  "vk_record.c";
  "vk_render_loop.c";
  "vk_tenant_alloc.c";
  "vk_transfer_loop.c";
  "vk_debug.c";
  "vk_draw.c";
  "tenant_callbacks_state.c";
  "tenant_sys.c";
  "tenant_callbacks.c";
  "tenant_callbacks_key.c";
  "tenant_callbacks_mouse.c";
  "tenant_input.c";
  "ssot_types.h";
  "ssot_render.h";
}
